[{"Process":{"Options":"Activates the 3D Desktop. 3ddeskd daemon must be running. Where OPTIONS are: --view= xxx Uses the options from the view in 3ddesktop.conf --mode= xxx Sets the arrangement mode (one of carousel (default), cylinder, linear, viewmaster, priceisright, flip, or random). --acquire[=#] Grab images for all the desktops by cycling thru (sleep for x millisecs at each screen for refresh) --acquirecurrent Grab image for current desktop --nozoom Disable the zoom out --changespeed How fast the rotation or sliding of faces takes. Default is 40, must be between 1 and 300. --zoomspeed How fast it zooms in an out. Default is 45, must be between 1 and 300. --gotoright Goto the desktop to the right --gotoleft Goto the desktop to the left --gotoup Goto the desktop to the up --gotodown Goto the desktop to the down --goto=# Goto specified column (deprecated, use --gotocolumn) --gotocolumn=# Goto specified column --gotorow=# Goto specified row --dontexit Don't exit after a goto --stop Stop 3ddesktop (kill 3ddeskd daemon) --reload Force a reload of 3ddesktop.conf --noautofun Disable Fun Mode --revmousewheel Reverse the mousewheel --swapmousebuttons Swap left and right buttons on the mouse --altmousebuttons Use alternate mousebuttons scheme: Button 1 activates, 2 goes back and exits, 3 goes back, 6 goes left, 7 goes right. --version Output version information and exit","Usage":"Bind a key combination to \/usr\/bin\/3ddesk and press the bound key. This will bring you into a 3d environment where you choose your next desktop. If the server hasn't been started it will try to start it.","Description":"3D Desktop is an OpenGL program for switching virtual desktops in a seamless 3-dimensional manner. The default \"visualization\" maps your screen onto an N-sided \"carousel\" which is rotated to select the next screen. When activated the current desktop appears to zoom out so as to make your desktop appear to be actually in a 3d environment with your other desktops.","Author":"Brad Wasson bard at wassonartistry.com Site Search Library linux docs linux man pages page load time Toys world sunlight moon phase trace explorer","Setup":"3ddesk --acquire This starts the 3ddeskd server and acquires an image of each of your virtual desktops. It will cycle through each desktop and return to your current.","Files":"\/etc\/3ddesktop\/3ddesktop.conf","Synopsis":"3ddesk [ OPTIONS ]","Process Name":"3ddesk","Link":"https:\/\/linux.die.net\/man\/1\/3ddesk","Name":"3ddesk - activates 3D-Desktop, a 3D desktop switcher."}},{"Process":{"Options":"3ddeskd accepts the following options: --acquire[=#] Grab images for all the desktops by cycling thru (sleep for # millisecs at each screen for refresh) --mirror Mirror the current desktop image to all the other desktop faces. This is a clever alternative to acquire. --dir=\/path The install dir if different than \/usr\/share\/3ddesktop --wm= Specify the Windowmanager type so all the virtual desktops are found correctly. Available options are: kde2, kde3, gnome1, gnome2, ewmh, fluxbox, windowmaker, enlightenment, sawfishonly, workspaces --texturesize=# Size of texture for the desktop images (larger for more detail) in powers of 2. Default is 1024, values from 16 to 2048 are accepted. --fastest Hog the CPU for smoothest operation -v Verbose\/debug information --version Output version information and exit","Description":"This is the server for 3ddesk. 3ddeskd runs at all times to reduce load time and maintain a persistent state. In order for 3ddesk to work the server needs to be running in the background before you can go 3D. Just run \"3ddeskd\" to start it. Give the --acquire option to acquire cached versions of all your desktops. It will cycle thru all your desktops\/workspaces. 3ddesk activates the server and gives you a fullscreen. You only need to start 3ddeskd once. If you run 3ddesk and it sees the server isn't started it will attempt to start it for you. When you start 3ddesktop without --acquire you will not see the images of your other desktops. It can only take a snapshot of your current desktop -- so either it must acquire them initially by cycling through all of them or they will not show up until you move from them using 3ddesktop. Your other virtual desktops will show up but only after you've been to them. The texture for the current desktop is acquired when you start 3ddesk so once you start 3ddesk from each virtual desktop your screens will all show up. They will only stay consistent if you only use 3ddesk to switch desktops (if you don't use another pager). Mess around with it and you will see how it works.","Author":"Brad Wasson bard at wassartistry.com Site Search Library linux docs linux man pages page load time Toys world sunlight moon phase trace explorer","Files":"\/etc\/3ddesktop\/3ddesktop.conf","Synopsis":"3ddeskd [ OPTIONS ]","Process Name":"3ddeskd","Link":"https:\/\/linux.die.net\/man\/1\/3ddeskd","Name":"3ddeskd - starts the daemon for 3D-Desktop, a 3D desktop switcher."}},{"Process":{"Copyright":"3ds2m Copyright © 1996-2001 by J.E. Hoffmann <je-h@gmx.net> This program is free software; you can redistribute it and\/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA. Site Search Library linux docs linux man pages page load time Toys world sunlight moon phase trace explorer","Options":"3ds2m accepts the following options: -h\/--help This help -o\/--output <filename> Write output to <filename> instead of stdout -m\/--mesh name Write only specific mesh.B -c\/--camera <name>","Description":"3ds2m is a tool to convert meshes of a 3DS file into a m-file.","Synopsis":"3ds2m [options] filename [options]","Process Name":"3ds2m","Link":"https:\/\/linux.die.net\/man\/1\/3ds2m","Name":"3ds2m - Converts meshes of a 3DS file into a m-file."}},{"Process":{"Copyright":"This program is free software; you can redistribute it and\/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA. Site Search Library linux docs linux man pages page load time Toys world sunlight moon phase trace explorer","Options":"3dsdump accepts the following options: -h\/--help This help -m\/--materials Dump materials -t\/--trimeshes Dump meshes -i\/--instance Dump mesh instances -c\/--cameras Dump cameras -l\/--lights Dump lights -n\/--nodes Dump node hierarchy","Description":"3dsdump is a tool that is used to display information about the internal structure of a 3DS file.","Synopsis":"3dsdump [options] filename [options]","Process Name":"3dsdump","Link":"https:\/\/linux.die.net\/man\/1\/3dsdump","Name":"3dsdump - Displays information about the internal structure of a 3DS file."}}]