[{"Process":{"Description":"3D Desktop is an OpenGL program for switching virtual desktops in a seamless 3-dimensional manner. The default \"visualization\" maps your screen onto an N-sided \"carousel\" which is rotated to select the next screen. When activated the current desktop appears to zoom out so as to make your desktop appear to be actually in a 3d environment with your other desktops.","Process Name":"3ddesk","Link":"https:\/\/linux.die.net\/man\/1\/3ddesk"}},{"Process":{"Description":"This is the server for 3ddesk. 3ddeskd runs at all times to reduce load time and maintain a persistent state. In order for 3ddesk to work the server needs to be running in the background before you can go 3D. Just run \"3ddeskd\" to start it. Give the --acquire option to acquire cached versions of all your desktops. It will cycle thru all your desktops\/workspaces. 3ddesk activates the server and gives you a fullscreen. You only need to start 3ddeskd once. If you run 3ddesk and it sees the server isn't started it will attempt to start it for you. When you start 3ddesktop without --acquire you will not see the images of your other desktops. It can only take a snapshot of your current desktop -- so either it must acquire them initially by cycling through all of them or they will not show up until you move from them using 3ddesktop. Your other virtual desktops will show up but only after you've been to them. The texture for the current desktop is acquired when you start 3ddesk so once you start 3ddesk from each virtual desktop your screens will all show up. They will only stay consistent if you only use 3ddesk to switch desktops (if you don't use another pager). Mess around with it and you will see how it works.","Process Name":"3ddeskd","Link":"https:\/\/linux.die.net\/man\/1\/3ddeskd"}},{"Process":{"Description":"3ds2m is a tool to convert meshes of a 3DS file into a m-file.","Process Name":"3ds2m","Link":"https:\/\/linux.die.net\/man\/1\/3ds2m"}},{"Process":{"Description":"3dsdump is a tool that is used to display information about the internal structure of a 3DS file.","Process Name":"3dsdump","Link":"https:\/\/linux.die.net\/man\/1\/3dsdump"}}]